examples/render_all_grammars/dot/tests_functional_test_scoping_metamodel_provider3_A.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40218504[ label="{Model|}"]

39973000[ label="{ID|}"]

40429992[ label="{STRING|}"]

40578072[ label="{BOOL|}"]

40437416[ label="{INT|}"]

40457816[ label="{FLOAT|}"]

40473560[ label="{STRICTFLOAT|}"]

40479096[ label="{NUMBER|}"]

40201176[ label="{BASETYPE|}"]

40206712[ label="{*OBJECT|}"]

37557272[ label="{Cls|+name:ID\l}"]

40220504[ label="{Method|+name:ID\l}"]

40410920[ label="{Obj|+name:ID\l}"]

40415864[ label="{Call|+name:ID\l}"]

39802328[ label="{Import|+importURI:STRING\l}"]

40087352[ label="{Comment|\\/\\/.*}"]



40218504 -> 39802328[arrowtail=diamond, dir=both, headlabel="imports 1..*"]
40218504 -> 37557272[arrowtail=diamond, dir=both, headlabel="cls 1..*"]
40218504 -> 40410920[arrowtail=diamond, dir=both, headlabel="obj 1..*"]
40218504 -> 40415864[arrowtail=diamond, dir=both, headlabel="call 1..*"]
40479096 -> 40473560 [dir=back]
40479096 -> 40437416 [dir=back]
40201176 -> 40479096 [dir=back]
40201176 -> 40457816 [dir=back]
40201176 -> 40578072 [dir=back]
40201176 -> 39973000 [dir=back]
40201176 -> 40429992 [dir=back]
40206712 -> 40201176 [dir=back]
37557272 -> 37557272[headlabel="extends 1..*"]
37557272 -> 40220504[arrowtail=diamond, dir=both, headlabel="methods 1..*"]
40410920 -> 37557272[headlabel="ref "]
40415864 -> 40410920[headlabel="obj "]
40415864 -> 40220504[headlabel="method "]

}
